#+TITLE: 第一讲实验物理的大数据方法总论
#+author: 续本达
#+LaTeX_CLASS: ctexart
#+PROPERTY: header-args :eval never-export :exports both

*** 例子
    把作业 =git clone= 下来。把已有的程序 clone 到本地

    #+begin_example
      $ git clone git@github.com:physics-data/aplusb-heroxbd.git
      Cloning into 'aplusb-heroxbd'...
      remote: Enumerating objects: 29, done.
      remote: Counting objects: 100% (29/29), done.
      remote: Compressing objects: 100% (19/19), done.
      remote: Total 29 (delta 4), reused 0 (delta 0), pack-reused 0
      Receiving objects: 100% (29/29), 4.45 KiB | 4.45 MiB/s, done.
      Resolving deltas: 100% (4/4), done.
    #+end_example

    #+NAME: 2f619678-0bc3-48b5-96c1-9103b783261d
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git clone -q git@github.com:physics-data/aplusb-heroxbd.git
      cd aplusb-heroxbd
      ls
    #+end_src

    #+RESULTS: 2f619678-0bc3-48b5-96c1-9103b783261d
    : aplusb.py  data  grade.py  README.md

    我一个程序 =aplusb.py= ，这是一个极简的 Python 程序，随后我们学习它的语法和语义。我将第一个 input 赋予变量 =a= ， 第二个 input 赋予变量 =b= ，完成了对它的修改。

    此时 =git diff= 可以显示在上一个 commit 之后做的改动。
    #+NAME: 187958d6-d6dc-4ab1-aec1-884f4801fd1a
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git diff
    #+end_src

    #+RESULTS: 187958d6-d6dc-4ab1-aec1-884f4801fd1a
    #+begin_example
      diff --git a/aplusb.py b/aplusb.py
      index b1042af..c6cd1b5 100644
      --- a/aplusb.py
      +++ b/aplusb.py
      @@ -1,5 +1,10 @@
       # TODO: read two ints from standard input
       # HINT: use input()

      +a = int(input())
      +b = int(input())
      +
       # TODO: print the result
      -# HINT: use print()
      \ No newline at end of file
      +# HINT: use print()
      +
      +print(a+b)
    #+end_example

    =aplusb.py= 原是空文件，只有助教给的提示，更改是增加了输入 =a= 和 =b= 以及输出 =a+b= 的行。

    另外我们用 =git status= 可以看到 =aplusb.py= 被更改（modified）。
    #+NAME: 08784120-b482-4ccf-a32a-a967e07b74f1
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git status
    #+end_src

    #+RESULTS: 08784120-b482-4ccf-a32a-a967e07b74f1
    : On branch master
    : Your branch is up to date with 'origin/master'.
    : 
    : Changes not staged for commit:
    :   (use "git add <file>..." to update what will be committed)
    :   (use "git restore <file>..." to discard changes in working directory)
    : 	modified:   aplusb.py
    : 
    : no changes added to commit (use "git add" and/or "git commit -a")
    
    使用 =git add= 把改动累加起来，再看一下 status。

    #+NAME: 3565b43c-c27e-4e75-aa2b-c0d771f101e9
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git add aplusb.py
      git status
    #+end_src

    #+RESULTS: 3565b43c-c27e-4e75-aa2b-c0d771f101e9
    : On branch master
    : Your branch is up to date with 'origin/master'.
    : 
    : Changes to be committed:
    :   (use "git restore --staged <file>..." to unstage)
    : 	modified:   aplusb.py
    : 

    =git add= 把文件做了一个 "staged" 的标记，它将用于commit（对应于提示中的 =Changes to be committed= ）。

    #+NAME: 465b86aa-b822-488b-9ea4-d9aeb9341591
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git commit -m "加上 a 与 b 的读入并输出两者之和"
    #+end_src

    #+RESULTS: 465b86aa-b822-488b-9ea4-d9aeb9341591
    : [master d4e354b] 加上 a 与 b 的读入并输出两者之和
    :  1 file changed, 6 insertions(+), 1 deletion(-)
    =-m= 后面接对这个改动的说明。 如果不跟随 =-m= 参数， =git= 将调用编辑器供我们输入说明。

    使用 =git log= 可以给出 =commit= 的历史，其中第一条是我们刚刚提交的。
    #+NAME: 5f0d9208-b47c-4690-b654-8a135548e79a
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git log
    #+end_src

    #+RESULTS: 5f0d9208-b47c-4690-b654-8a135548e79a
    #+begin_example
    commit d4e354ba1c63e9689ef253aada00aedd7f50758e (HEAD -> master)
    Author: Benda Xu <heroxbd@gentoo.org>
    Date:   Wed Feb 16 20:27:23 2022 +0800

        加上 a 与 b 的读入并输出两者之和

    commit 1abf3e5528c824f3e8b1bf873dfc6222bd3fcefb (origin/master, origin/HEAD)
    Author: Shengqi Chen <i@harrychen.xyz>
    Date:   Tue Aug 18 16:36:58 2020 +0800

        Update GitHub Classroom Autograding Workflow

    commit f34ce2373540c7092b8b35fef57c0e5776414f9d
    Author: Shengqi Chen <i@harrychen.xyz>
    Date:   Tue Aug 18 16:36:57 2020 +0800

        Update GitHub Classroom Autograding

    commit 943846fc6cd4999f990c734fba69ab4666f73fc5
    Author: Shengqi Chen <i@harrychen.xyz>
    Date:   Tue Aug 18 16:36:21 2020 +0800

        GitHub Classroom Autograding Workflow

    commit 3191ca5f179f441241e4c3f659d88ef403806a0d
    Author: Shengqi Chen <i@harrychen.xyz>
    Date:   Tue Aug 18 16:36:20 2020 +0800

        GitHub Classroom Autograding

    commit 865818ac4f46382fd52f983c0deaafca9d6e788d
    Author: Chen <jiegec@qq.com>
    Date:   Tue Aug 18 16:36:18 2020 +0800

        Initial commit
    #+end_example

    通过 =git show= 确认 commit 。

    #+NAME: 21c4c8b5-9cd4-4020-bfa5-4a8284a5d5ba
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git show
    #+end_src

    #+RESULTS: 21c4c8b5-9cd4-4020-bfa5-4a8284a5d5ba
    #+begin_example
    commit d4e354ba1c63e9689ef253aada00aedd7f50758e (HEAD -> master)
    Author: Benda Xu <heroxbd@gentoo.org>
    Date:   Wed Feb 16 20:27:23 2022 +0800

        加上 a 与 b 的读入并输出两者之和

    diff --git a/aplusb.py b/aplusb.py
    index b1042af..c6cd1b5 100644
    --- a/aplusb.py
    +++ b/aplusb.py
    @@ -1,5 +1,10 @@
     # TODO: read two ints from standard input
     # HINT: use input()

    +a = int(input())
    +b = int(input())
    +
     # TODO: print the result
    -# HINT: use print()
    \ No newline at end of file
    +# HINT: use print()
    +
    +print(a+b)
    #+end_example
    
    与 =git diff= 的对比可见这正是我们刚做的修改。

*** 退回至“已修改”状态
    add 的逆向操作是 reset，用于把在“待提交”阶段的文件退回至“已修改”状态。

    #+NAME: 3babc3c0-3551-4258-bcb7-6eb6895167b7
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git status
    #+end_src

    #+RESULTS: 3babc3c0-3551-4258-bcb7-6eb6895167b7
    : On branch master
    : Your branch is ahead of 'origin/master' by 1 commit.
    :   (use "git push" to publish your local commits)
    : 
    : Changes to be committed:
    :   (use "git restore --staged <file>..." to unstage)
    : 	modified:   aplusb.py
    : 

    要取消这个“待提交”的修改，可以使用 =git reset= ，
    #+NAME: 459b19ba-4164-4a58-9b8d-5bce8c762dc1
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git reset aplusb.py
      git status
    #+end_src

    #+RESULTS: 459b19ba-4164-4a58-9b8d-5bce8c762dc1
    #+begin_example
    Unstaged changes after reset:
    M	aplusb.py
    On branch master
    Your branch is ahead of 'origin/master' by 1 commit.
      (use "git push" to publish your local commits)

    Changes not staged for commit:
      (use "git add <file>..." to update what will be committed)
      (use "git restore <file>..." to discard changes in working directory)
            modified:   aplusb.py

    no changes added to commit (use "git add" and/or "git commit -a")
    #+end_example

    我们看到 =aplusb.py= 退到了“已修改”状态，命令中的提示是"unstaged"。

*** 把 commit 推送到远端
    大家注意 status 中有一行 “Your branch is ahead of 'origin/master' by 1 commit.”提示我们本地的仓库比远端多了一个 commit，还告诉我们 “use "git push" to publish your local commits”。

    #+NAME: 4061d8fd-a2fe-4b0c-ac3d-92d7d8522902
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git push
    #+end_src

    #+RESULTS: 4061d8fd-a2fe-4b0c-ac3d-92d7d8522902
    : Enumerating objects: 5, done.
    : Counting objects:  20% (1/5)Counting objects:  40% (2/5)Counting objects:  60% (3/5)Counting objects:  80% (4/5)Counting objects: 100% (5/5)Counting objects: 100% (5/5), done.
    : Delta compression using up to 256 threads
    : Compressing objects: 100% (3/3), done.
    : Writing objects: 100% (3/3), 355 bytes | 355.00 KiB/s, done.
    : Total 3 (delta 2), reused 0 (delta 0), pack-reused 0
    : remote: Resolving deltas: 100% (2/2), completed with 2 local objects.
    : To github.com:physics-data/aplusb-heroxbd.git
    :    1abf3e5..de27c4f  master -> master

    这样就把 commit 推送到了远端。注意在本地与远程交换差分时，commit 是传递的单位。未 commit 的修改，不论在“待提交”还是“已修改”状态，都不能通过 git 交换。

    再看 status
    #+NAME: 933f4896-9914-4f7d-a3b1-6d98184041f9
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git status
    #+end_src

    #+RESULTS: 933f4896-9914-4f7d-a3b1-6d98184041f9
    : On branch master
    : Your branch is up to date with 'origin/master'.
    : 
    : Changes not staged for commit:
    :   (use "git add <file>..." to update what will be committed)
    :   (use "git restore <file>..." to discard changes in working directory)
    : 	modified:   aplusb.py
    : 
    : no changes added to commit (use "git add" and/or "git commit -a")
    
    注意“Your branch is up to date with 'origin/master'.”两者已经同步完成。

*** 撤销已有 commit
    要改动已有 commit ，该怎么办？

    简单方式是 =git revert= 。它自动生成一个相反的差分，把某一个差分“湮灭”掉，例如在我的仓库中，
    #+NAME: d517865d-01b8-468d-8c68-708ceda99e18
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git log -n 2
    #+end_src

    #+RESULTS: d517865d-01b8-468d-8c68-708ceda99e18
    #+begin_example
    commit de27c4f69c894458d51430986360b8c0db527fa5 (HEAD -> master, origin/master, origin/HEAD)
    Author: Benda Xu <heroxbd@gentoo.org>
    Date:   Sun Jun 26 21:42:14 2022 +0800

        加上 a 与 b 的读入并输出两者之和

    commit 1abf3e5528c824f3e8b1bf873dfc6222bd3fcefb
    Author: Shengqi Chen <i@harrychen.xyz>
    Date:   Tue Aug 18 16:36:58 2020 +0800

        Update GitHub Classroom Autograding Workflow
    #+end_example

    我想去掉代号为 de27c4f69c894458d51430986360b8c0db527fa5 的 commit。这个代号是差分的哈希值，无歧义时，取前几位亦可。

    #+NAME: 2a186f4c-f84a-4513-a4a6-e56156b167e3
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git revert de27c4f6 --no-edit
    #+end_src

    #+RESULTS: 2a186f4c-f84a-4513-a4a6-e56156b167e3
    : [master f6066f5] Revert "加上 a 与 b 的读入并输出两者之和"
    :  Date: Sun Jun 26 21:58:51 2022 +0800
    :  1 file changed, 1 insertion(+), 3 deletions(-)

    #+NAME: 0c56d7ec-fe1f-4e0e-8cb5-76b5d8e6022b
    #+begin_src ein-bash :results output :session https://dpcg.g.airelinux.org/user/xubd/lecture.ipynb
      git log -n 3
    #+end_src

    #+RESULTS: 0c56d7ec-fe1f-4e0e-8cb5-76b5d8e6022b
    #+begin_example
    commit f6066f54aac1bb29aec313b28cb9f0facc90612b (HEAD -> master)
    Author: Benda Xu <heroxbd@gentoo.org>
    Date:   Sun Jun 26 21:58:51 2022 +0800

        Revert "加上 a 与 b 的读入并输出两者之和"

        This reverts commit de27c4f69c894458d51430986360b8c0db527fa5.

    commit de27c4f69c894458d51430986360b8c0db527fa5 (origin/master, origin/HEAD)
    Author: Benda Xu <heroxbd@gentoo.org>
    Date:   Sun Jun 26 21:42:14 2022 +0800

        加上 a 与 b 的读入并输出两者之和

    commit 1abf3e5528c824f3e8b1bf873dfc6222bd3fcefb
    Author: Shengqi Chen <i@harrychen.xyz>
    Date:   Tue Aug 18 16:36:58 2020 +0800

        Update GitHub Classroom Autograding Workflow
    #+end_example
    这样 de27c4f6 差分就被撤销了，由于撤销也是一种对仓库的更改，因此它对应一个新的 commit，并且有历史记录。

